//--------------------------------------------------------------------------------
//
//　3DRigidbodyComponent.cpp
//	Author : Xu Wenjie
//	Date   : 2017-05-31
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "3DRigidbodyComponent.h"
#include "gameObject3D.h"

//--------------------------------------------------------------------------------
//  クラス
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  コンストラクタ
//--------------------------------------------------------------------------------
C3DRigidbodyComponent::C3DRigidbodyComponent(CGameObject* const pGameObj)
	: CRigidbodyComponent(pGameObj, RB_3D)
	, m_fMass(1.0f)
	, m_vMovement(CKFVec3(0.0f))
	, m_vVelocity(CKFVec3(0.0f))
{
}

//--------------------------------------------------------------------------------
//  更新処理
//--------------------------------------------------------------------------------
void C3DRigidbodyComponent::Update(void)
{
	CGameObject3D* pObj = (CGameObject3D*)m_pGameObj;
	CKFVec3 vPos = pObj->GetPosNext();

	//重力
	m_vVelocity.m_fY -= 0.981f * m_fMass / TIMER_INTERVAL;

	vPos += m_vVelocity;
	vPos += m_vMovement;

	//処理完了
	m_vVelocity *= 0.95f;
	m_vMovement = CKFVec3(0.0f);
	pObj->SetPosNext(vPos);
}