//--------------------------------------------------------------------------------
//	アクター描画コンポネント
//　actorMeshDrawComponent.h
//	Author : Xu Wenjie
//	Date   : 2017-05-22
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "drawComponent.h"

//--------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------
class CActorMeshComponent;

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  アクター描画コンポネントクラス
//--------------------------------------------------------------------------------
class CActorMeshDrawComponent : public CDrawComponent
{
public:
	CActorMeshDrawComponent(CActorMeshComponent* const pMesh, CGameObject* const pGameObj)
		: CDrawComponent(pGameObj), c_pMesh(pMesh) {}
	~CActorMeshDrawComponent() {}

	void	Draw(void) override;

private:
	CActorMeshComponent* const c_pMesh;
};