//--------------------------------------------------------------------------------
//	boxColliderコンポネント
//　boxColliderComponent.cpp
//	Author : Xu Wenjie
//	Date   : 2017-07-28
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "boxCollider.h"

//--------------------------------------------------------------------------------
//
//  public
//
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//	関数名：GetNextWorldVertexes
//  関数説明：世界中の頂点位置を取得する
//	引数：	なし
//	戻り値：list<Vector3>
//--------------------------------------------------------------------------------
list<Vector3> BoxCollider::GetNextWorldVertexes(void) const
{
	auto copy = localVertexes;
	const auto& worldMatrix = GetNextWorldMatrix();
	for (auto& vertex : copy)
	{
		vertex = Vector3::TransformCoord(vertex, worldMatrix);
	}
	return copy;
}