//--------------------------------------------------------------------------------
//	colliderコンポネント
//　colliderComponent.h
//	Author : Xu Wenjie
//	Date   : 2017-05-18
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "component.h"
#include "colliderManager.h"

//--------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  Colliderポネントクラス
//--------------------------------------------------------------------------------
class CColliderComponent : public CComponent
{
public:
	//--------------------------------------------------------------------------------
	//  構造体定義
	//--------------------------------------------------------------------------------

	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	CColliderComponent(CGameObject* const pGameObj, const CM::COL_TYPE& type, const CM::MODE& mode);
	~CColliderComponent() {}

	virtual KFRESULT	Init(void) override = 0;
	virtual void		Uninit(void) override;
	virtual void		Update(void) = 0;
	virtual void		OnCollision(CColliderComponent& collider) {}

	//Get関数
	const CM::COL_TYPE	GetType(void) const { return m_type; }

protected:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	CColliderComponent() : CComponent() , m_type(CM::COL_MAX) {}

	//--------------------------------------------------------------------------------
	//  変数定義
	//--------------------------------------------------------------------------------
	CM::COL_TYPE	m_type;		//colliderのタイプ
	CM::COL_ITR		m_itr;		//マネージャlist中の位置
	CM::MODE		m_mode;		//Static/Dynamic mode
	CKFVec3			m_vPos;		//相対位置
};

//--------------------------------------------------------------------------------
//  ヌルコリジョンコンポネント
//--------------------------------------------------------------------------------
class CNullColliderComponent : public CColliderComponent
{
public:
	CNullColliderComponent() : CColliderComponent() {}
	~CNullColliderComponent() {}

	KFRESULT	Init(void) override { return KF_SUCCEEDED; }
	void		Uninit(void) override {}
	void		Update(void) override {}
	void		Release(void) override {}
	void		ReceiveMsg(const MESSAGE &msg) override {}
};