//--------------------------------------------------------------------------------
//
//　collisionComponent.h
//	Author : Xu Wenjie
//	Date   : 2017-05-18
//--------------------------------------------------------------------------------
//  Update : 
//	
//--------------------------------------------------------------------------------
#ifndef _COLLISION_COMPONENT_H_
#define _COLLISION_COMPONENT_H_

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "component.h"

//--------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------
class CGameObject;

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  コリジョンコンポネントクラス
//--------------------------------------------------------------------------------
class CCollisionComponent : public CComponent
{
public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	CCollisionComponent() {}
	~CCollisionComponent() {}

	virtual KFRESULT	Init(void) = 0;
	virtual void		Uninit(void) = 0;
	virtual void		Update(CGameObject &gameObj) = 0;
	virtual void		Release(void) = 0;
	virtual void		ReceiveMsg(const MESSAGE &msg) override = 0;
};

//--------------------------------------------------------------------------------
//  ヌルコリジョンコンポネント
//--------------------------------------------------------------------------------
class CNullCollisionComponent : public CCollisionComponent
{
public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	CNullCollisionComponent() {}
	~CNullCollisionComponent() {}

	KFRESULT	Init(void) override { return KF_SUCCEEDED; }
	void		Uninit(void) override {}
	void		Update(CGameObject &gameObj) override {}
	void		Release(void) override {}
	void		ReceiveMsg(const MESSAGE &msg) override {}
};

#endif
