//--------------------------------------------------------------------------------
//	キューブドメッシュコンポネント
//　cubeMeshComponent.h
//	Author : Xu Wenjie
//	Date   : 2017-05-22
//--------------------------------------------------------------------------------
#ifndef _CUBE_MESH_COMPONENT_H_
#define _CUBE_MESH_COMPONENT_H_

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "3DMeshComponent.h"

//--------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  フィールドメッシュコンポネントクラス
//--------------------------------------------------------------------------------
class CCubeMeshComponent : public C3DMeshComponent
{
public:
	CCubeMeshComponent(const CKFVec3 &vSize, const CKFColor &cColor) : C3DMeshComponent()
		, m_vSize(vSize)
		, m_cColor(cColor)
	{}

	~CCubeMeshComponent() {}

	KFRESULT	Init(void) override;

private:
	void		MakeVertex(void);

	CKFVec3		m_vSize;
	CKFColor	m_cColor;
};

#endif