//--------------------------------------------------------------------------------
//　editor_camera.h
//	エディタ用カメラクラス
//	Author : 徐文杰(KodFreedom)
//--------------------------------------------------------------------------------
#pragma once
#include "camera.h"

#if defined(EDITOR)
//--------------------------------------------------------------------------------
//  エディタ用カメラクラス
//--------------------------------------------------------------------------------
class EditorCamera : public Camera
{
public:
	//--------------------------------------------------------------------------------
	//  constructors and destructors
	//--------------------------------------------------------------------------------
	EditorCamera() : Camera() {}
	~EditorCamera() {}

	//--------------------------------------------------------------------------------
	//  初期化処理
	//--------------------------------------------------------------------------------
	void Init(void) override;

	//--------------------------------------------------------------------------------
	//  更新処理
	//--------------------------------------------------------------------------------
	void Update(void) override;

private:
	//--------------------------------------------------------------------------------
	//  定数定義
	//--------------------------------------------------------------------------------
	static constexpr float kRotationSpeed = 0.05f; //カメラ回転速度
	static constexpr float kStartRotationMin = 0.2f; //カメラ回転開始のスティック最小値
	static constexpr float kZoomSpeed = 0.5f; //ズーム速度
	static constexpr float kDistanceMin = 3.0f; //注視点と注目点の最小距離
	static constexpr float kDistanceMax = 500.0f; //注視点と注目点の最大距離	
};
#endif