//--------------------------------------------------------------------------------
//	エディタビヘイビアコンポネント
//　EditorController.h
//	Author : Xu Wenjie
//	Date   : 2017-07-17
//--------------------------------------------------------------------------------
#pragma once
#if defined(_DEBUG) || defined(EDITOR)
//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "behavior.h"

//--------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------
class FieldEditor;
class ModelEditor;

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
class EditorController : public Behavior
{
public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	EditorController(GameObject* const owner);
	~EditorController() {}

	bool	Init(void) override;
	void	Uninit(void) override;
	void	Update(void) override;
	void	LateUpdate(void) override {}

	void	SetFieldEditor(GameObject* fieldEditorObject);
	void	SetModelEditor(ModelEditor* value) { modelEditor = value; }

private:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	void	save(void);
	void	showMainWindow(void);
	void	showPositonWindow(void);

	//--------------------------------------------------------------------------------
	//  変数定義
	//--------------------------------------------------------------------------------
	bool			isAutoHeight;
	FieldEditor*	fieldEditor;
	ModelEditor*	modelEditor;
	float			moveSpeed;
};
#endif // _DEBUG