//--------------------------------------------------------------------------------
//	エネミー攻撃モード
//　enemyAttackMode.h
//	Author : Xu Wenjie
//	Date   : 2017-07-17
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "AIMode.h"

//--------------------------------------------------------------------------------
//  クラス
//--------------------------------------------------------------------------------
class CEnemyAttackMode : public CAIMode
{
public:
	CEnemyAttackMode() : CAIMode(AM_ATTACK), m_countWait(0) {}
	~CEnemyAttackMode() override {}
	void Update(CEnemyBehaviorComponent& enemy) override;

private:
	int m_countWait;
};