//--------------------------------------------------------------------------------
//
//　FadeSystem.h
//	Author : Xu Wenjie
//	Date   : 2017-06-09
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "main.h"

//--------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------
class Mode;

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
class FadeSystem
{
public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	static auto	Create(void)
	{
		if (instance) return instance;
		instance = new FadeSystem;
		instance->init();
		return instance;
	}
	static void Release(void) { SAFE_UNINIT(instance); }
	static auto Instance(void) { return instance; }

	void	Update(void);
	void	Draw(void);
	void	FadeTo(Mode* nextMode, const float fadeTime = 1.0f);

private:
	//--------------------------------------------------------------------------------
	//  列挙型定義
	//--------------------------------------------------------------------------------
	enum State
	{
		None = 0,
		FadeIn,
		FadeOut,
		Max
	};

	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	FadeSystem()
		: currentState(FadeIn)
		, nextMode(nullptr)
		, color(Color::Black)
		, fadeTime(0.0f)
		, timeCounter(0.0f)
	{}
	~FadeSystem() {}
	void init(void);
	void uninit(void);
	void fadeIn(void);
	void fadeOut(void);
	void setColor(void);

	//--------------------------------------------------------------------------------
	//  変数定義
	//--------------------------------------------------------------------------------
	Color				color;
	State				currentState;
	Mode*				nextMode;
	float				fadeTime;
	float				timeCounter;
	static FadeSystem*	instance;
};