//--------------------------------------------------------------------------------
//
//　gameObjManager.cpp
//	Author : Xu Wenjie
//	Date   : 2017-5-10
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "gameObjectManager.h"
#include "gameObject.h"

//--------------------------------------------------------------------------------
//  静的メンバ変数
//--------------------------------------------------------------------------------
GameObjectManager* GameObjectManager::instance = nullptr;

//--------------------------------------------------------------------------------
//
//  Public
//
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  リリース処理
//--------------------------------------------------------------------------------
void GameObjectManager::ReleaseAll(void)
{
	for (auto& list : GameObjects)
	{
		for (auto itr = list.begin(); itr != list.end();)
		{
			(*itr)->Release();
			itr = list.erase(itr);
		}
	}
}

//--------------------------------------------------------------------------------
//  更新処理
//--------------------------------------------------------------------------------
void GameObjectManager::Update(void)
{
	// 生きてないオブジェクトを削除する
	for (auto& list : GameObjects)
	{
		for (auto itr = list.begin(); itr != list.end();)
		{
			if (!(*itr)->IsAlive())
			{
				(*itr)->Release();
				itr = list.erase(itr);
			}
			else { ++itr; }
		}
	}

	for (auto& list : GameObjects)
	{
		for (auto gameObject : list)
		{
			gameObject->Update();
		}
	}
}

//--------------------------------------------------------------------------------
//  更新処理(描画直前)
//--------------------------------------------------------------------------------
void GameObjectManager::LateUpdate(void)
{
	for (auto& list : GameObjects)
	{
		for (auto gameObject : list)
		{
			gameObject->LateUpdate();
		}
	}
}