//--------------------------------------------------------------------------------
//	物理演算システム
//　KF_PhysicsSystem.h
//	Author : Xu Wenjie
//	Date   : 2017-07-25
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------
class CCollision;

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
class CKFPhysicsSystem
{
public:
	//--------------------------------------------------------------------------------
	//  定数定義
	//--------------------------------------------------------------------------------
	static const CKFVec3 sc_vGravity;	//重力

	//--------------------------------------------------------------------------------
	//  関数宣言
	//--------------------------------------------------------------------------------
	CKFPhysicsSystem() { m_listCollision.clear(); }
	~CKFPhysicsSystem() {}

	static auto	Create(void)
	{
		auto pPs = new CKFPhysicsSystem;
		return pPs;
	}
	void		Release(void)
	{
		uninit();
		delete this;
	}
	void		Update(void);
	void		Clear(void);
	void		RegisterCollision(CCollision* pCollision);

private:
	//--------------------------------------------------------------------------------
	//  関数宣言
	//--------------------------------------------------------------------------------
	void		uninit(void);
	void		resolve(CCollision& collision);
	void		resolveVelocity(CCollision& collision);
	void		resolveInterpenetration(CCollision& collision);
	float		calculateSeparatingVelocity(CCollision& collision);
	void		calculateCollisionBasis(CCollision& collision);

	//--------------------------------------------------------------------------------
	//  変数宣言
	//--------------------------------------------------------------------------------
	list<CCollision*> m_listCollision;
};