//--------------------------------------------------------------------------------
//
//　light.h
//	Author : Xu Wenjie
//	Date   : 2017-11-02
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  列挙型定義
//--------------------------------------------------------------------------------
enum LightType
{
	Point = 1,
	Spot = 2,
	Directional = 3,
};

//--------------------------------------------------------------------------------
//  クラス
//--------------------------------------------------------------------------------
class Light
{
	friend class LightManager;

public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	void SetPosition(const Vector3& newPosition)
	{
		position = newPosition;
		set();
	}
	void SetDirection(const Vector3& newDirection)
	{
		direction = newDirection;
		set();
	}
	void SetDiffuse(const Color& newDiffuse)
	{
		diffuse = newDiffuse;
		set();
	}
	void SetAmbient(const Color& newAmbient)
	{
		ambient = newAmbient;
		set();
	}

private:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	Light(const int id, const LightType& type, const Vector3& position, const Vector3& direction, const Color& diffuse, const Color& ambient);
	~Light();
	void set(void);

	//--------------------------------------------------------------------------------
	//  変数定義
	//--------------------------------------------------------------------------------
	int			id;
	LightType	type;
	Vector3		position;
	Vector3		direction;
	Color		diffuse;
	Color		ambient;
};

