//--------------------------------------------------------------------------------
//　main.h
//	Author : 徐文杰(KodFreedom)
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
// KF関数
#include "kf_math.h"
#include "kf_utility.h"
using namespace kodfreedom;

//--------------------------------------------------------------------------------
//  定数定義
//--------------------------------------------------------------------------------
#define SCREEN_WIDTH		(1280)								//ウインドウ幅
#define SCREEN_HEIGHT		(720)								//ウインドウ高さ
#define FRAME_PER_SECOND	(60)								
#define TIMER_INTERVAL		(1000.0f / FRAME_PER_SECOND)		//更新間隔
#define DELTA_TIME			(TIMER_INTERVAL * 0.001f)			//更新間隔(秒単位)