//--------------------------------------------------------------------------------
//	マテリアルマネージャ
//　materialManager.h
//	Author : Xu Wenjie
//	Date   : 2016-07-24
//--------------------------------------------------------------------------------
//  Update : 
//	
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "main.h"
#include "materialManager.h"

//--------------------------------------------------------------------------------
//  クラス
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//	CKFMaterial
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  コンストラクタ
//--------------------------------------------------------------------------------
CKFMaterial::CKFMaterial()
	: m_cAmbient(CKFColor(0.0f))
	, m_cDiffuse(CKFColor(0.0f))
	, m_cEmissive(CKFColor(0.0f))
	, m_cSpecular(CKFColor(0.0f))
	, m_fPower(0.0f)
{

}

//--------------------------------------------------------------------------------
//  キャスト(D3DMATERIAL9)
//	DXの環境のため(マテリアル)オーバーロードする
//--------------------------------------------------------------------------------
CKFMaterial::operator D3DMATERIAL9() const
{
	D3DMATERIAL9 vAnswer;

	vAnswer.Ambient = m_cAmbient;
	vAnswer.Diffuse = m_cDiffuse;
	vAnswer.Emissive = m_cEmissive;
	vAnswer.Specular = m_cSpecular;
	vAnswer.Power = m_fPower;

	return vAnswer;
}

//--------------------------------------------------------------------------------
//	CMaterialManager
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  初期化処理
//--------------------------------------------------------------------------------
void CMaterialManager::Init(void)
{
	m_aMaterial[MAT_NORMAL] = InitMaterial(CKFColor(1.0f)
		, CKFColor(1.0f)
		, CKFColor(0.0f, 0.0f, 0.0f, 1.0f)
		, CKFColor(0.0f, 0.0f, 0.0f, 1.0f)
		, 0.8f);
}

//--------------------------------------------------------------------------------
//  マテリアル取得
//--------------------------------------------------------------------------------
CKFMaterial CMaterialManager::GetMaterial(const MATERIAL &mat)
{
	return m_aMaterial[mat];
}

//--------------------------------------------------------------------------------
//  マテリアル設定
//--------------------------------------------------------------------------------
CKFMaterial CMaterialManager::InitMaterial(const CKFColor &cAmbient, const CKFColor &cDiffuse, const CKFColor &cSpecular, const CKFColor &cEmissive, const float &fPower)
{
	CKFMaterial mat;
	mat.m_cAmbient = cAmbient;		// 環境光の反射率
	mat.m_cDiffuse = cDiffuse;		// 漫射光の反射率
	mat.m_cSpecular = cSpecular;	// 鏡面光の反射率
	mat.m_cEmissive = cEmissive;	// 自発光
	mat.m_fPower = fPower;			// ハイライトのシャープネス
	return mat;
}