//--------------------------------------------------------------------------------
//	メッシュコンポネント
//　meshComponent.cpp
//	Author : Xu Wenjie
//	Date   : 2017-07-16
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "meshComponent.h"
#include "manager.h"
#include "meshManager.h"

//--------------------------------------------------------------------------------
//	クラス
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  終了処理
//--------------------------------------------------------------------------------
void CMeshComponent::Uninit(void)
{
	if (!m_strMeshName.empty())
	{
		Main::GetManager()->GetMeshManager()->DisuseMesh(m_strMeshName);
		m_strMeshName.clear();
	}
}

//--------------------------------------------------------------------------------
//  更新処理
//--------------------------------------------------------------------------------
void CMeshComponent::SetMeshName(const string& strMeshName)
{
	if (!m_strMeshName.empty())
	{
		Main::GetManager()->GetMeshManager()->DisuseMesh(m_strMeshName);
		m_strMeshName.clear();
	}

	m_strMeshName = strMeshName;
	Main::GetManager()->GetMeshManager()->UseMesh(m_strMeshName);
}