//--------------------------------------------------------------------------------
//	メッシュ
//　mesh.h
//	Author : Xu Wenjie
//	Date   : 2017-07-15
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "main.h"

//--------------------------------------------------------------------------------
//  クラス
//--------------------------------------------------------------------------------
class CMesh
{
public:
	CMesh() : m_nNumVtx(0), m_nNumIdx(0), m_nNumPolygon(0) {}
	~CMesh() 
	{
		SAFE_RELEASE(m_pVtxBuffer);
		SAFE_RELEASE(m_pIdxBuffer);
	}

	int				m_nNumVtx;
	int				m_nNumIdx;
	int				m_nNumPolygon;

#ifdef USING_DIRECTX
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuffer;	// 頂点バッファへのポインタ
	LPDIRECT3DINDEXBUFFER9	m_pIdxBuffer;	// インデックスへのポインタ
#endif
};