//--------------------------------------------------------------------------------
//	3dメッシュ描画コンポネント
//　mesh_renderer_3d_skin.cpp
//	Author : Xu Wenjie
//--------------------------------------------------------------------------------
#include "mesh_renderer_3d.h"
#include "render_system.h"

//--------------------------------------------------------------------------------
//  描画処理
//--------------------------------------------------------------------------------
void MeshRenderer3d::RenderBy(const RenderSystem& render_system)
{
	render_system.Render3dMesh(mesh_name_);
}