//--------------------------------------------------------------------------------
//	3dスキンメッシュ描画コンポネント
//　mesh_renderer_3d_skin.h
//	Author : Xu Wenjie
//--------------------------------------------------------------------------------
#pragma once
#include "mesh_renderer.h"

//--------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------
class Animator;

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
class MeshRenderer3dSkin : public MeshRenderer
{
public:
	//--------------------------------------------------------------------------------
	//  constructors and destructors
	//--------------------------------------------------------------------------------
	MeshRenderer3dSkin(const Animator& animator, GameObject& owner
		, const RenderPriority& priority = kDefaultPriority
		, const ShaderType& shader_type = kDefaultShader)
		: MeshRenderer(owner, priority, shader_type)
		, animator_(animator) {}
	~MeshRenderer3dSkin() {}

	//--------------------------------------------------------------------------------
	//  描画処理
	//--------------------------------------------------------------------------------
	void RenderBy(const RenderSystem& render_system) override;

#if defined(USING_DIRECTX) && (DIRECTX_VERSION == 9)
	//--------------------------------------------------------------------------------
	//  テクスチャの取得
	//--------------------------------------------------------------------------------
	const LPDIRECT3DTEXTURE9 GetBoneTexture(void) const;
#endif

private:
	//--------------------------------------------------------------------------------
	//  変数定義
	//--------------------------------------------------------------------------------
	const Animator& animator_; // ボーン情報を持ってるアニメーター
};