//--------------------------------------------------------------------------------
//	メッシュコンポネント
//　meshComponent.h
//	Author : Xu Wenjie
//	Date   : 2017-05-21
//--------------------------------------------------------------------------------
#ifndef _MESH_COMPONENT_H_
#define _MESH_COMPONENT_H_

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "component.h"

//--------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------
class CGameObject;

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  メッシュコンポネントクラス
//--------------------------------------------------------------------------------
class CMeshComponent : public CComponent
{
public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	CMeshComponent() : CComponent() {}
	~CMeshComponent() {}

	virtual KFRESULT	Init(void) override = 0;
	virtual void		Uninit(void) override = 0;
	virtual void		Update(CGameObject &gameObj) = 0;
	virtual void		ReceiveMsg(const MESSAGE &msg) override {}
};

//--------------------------------------------------------------------------------
//  ヌルメッシュコンポネントクラス
//--------------------------------------------------------------------------------
class CNullMeshComponent : public CMeshComponent
{
public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	CNullMeshComponent() {}
	~CNullMeshComponent() {}

	KFRESULT	Init(void) override {}
	void		Uninit(void) override {}
	void		Update(CGameObject &gameObj) override {}
	void		Release(void) override {}
	void		ReceiveMsg(const MESSAGE &msg) override {}
};

#endif
