//--------------------------------------------------------------------------------
//
//　model.h
//	Author : Xu Wenjie
//	Date   : 2017-01-24
//--------------------------------------------------------------------------------
//  Update : 
//	
//--------------------------------------------------------------------------------
#ifndef _MODEL_H_
#define _MODEL_H_

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "modelManager.h"
#include "materialManager.h"

//--------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
class CModel
{
public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	CModel() {}
	~CModel() {}

	virtual HRESULT Init(void) { return S_OK; }
	virtual void	Uninit(void) = 0;
	virtual void	Draw(void) = 0;

	const CMOM::MODEL_TYPE GetModelType(void) const { return m_modelType; }

protected:
	//--------------------------------------------------------------------------------
	//  構造体定義
	//--------------------------------------------------------------------------------
	struct XFILE
	{
		std::vector<LPDIRECT3DTEXTURE9>	vectorTexture;	//textureインターフェース
		LPD3DXMESH						pMesh;			//メッシュ情報インターフェイス
		LPD3DXBUFFER					pBufferMaterial;//マテリアル情報　動的メモリ
		DWORD							dwNumMaterial;	//モデルのマテリアル数
	};

	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	static KFRESULT LoadXFile(XFILE* pXFile, const LPCSTR &pXFilePath);
	static void		DrawXFile(const XFILE &XFile);
	static void		DrawXFile(const XFILE &XFile, const CMM::MATERIAL &matType);
	static void		ReleaseXFile(XFILE* pXFile);

	//--------------------------------------------------------------------------------
	//  変数定義
	//--------------------------------------------------------------------------------
	CMOM::MODEL_TYPE m_modelType;
};

#endif