//--------------------------------------------------------------------------------
//
//　mode.cpp
//	Author : Xu Wenjie
//	Date   : 2017-04-28
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "mode.h"
#include "gameObjectManager.h"
#include "physicsSystem.h"
#include "UISystem.h"
#include "renderManager.h"
#include "lightManager.h"
#include "soundManager.h"
#include "cameraManager.h"

//--------------------------------------------------------------------------------
//  クラス
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//
//  Private
//
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  終了処理
//--------------------------------------------------------------------------------
void Mode::uninit(void)
{
	PhysicsSystem::Instance()->Clear();
	GameObjectManager::Instance()->ReleaseAll();
	UISystem::Instance()->ReleaseAll();
	RenderManager::Instance()->Clear();
	LightManager::Instance()->ReleaseAll();
	SoundManager::Instance()->StopAll();
	CameraManager::Instance()->ReleaseAll();
}