//--------------------------------------------------------------------------------
//
//　motionInfo.h
//	Author : Xu Wenjie
//	Date   : 2017-07-06
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "main.h"

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  BoneFrameクラス
//--------------------------------------------------------------------------------
class BoneFrame
{
public:
	BoneFrame(const Vector3& position = Vector3::Zero, const Quaternion& rotation = Quaternion::Identity)
		: Position(position), Rotation(rotation) {}
	~BoneFrame() {}

	Vector3		Position;
	Quaternion	Rotation;
};

//--------------------------------------------------------------------------------
//  MotionFrameクラス
//	モーションの一フレーム（全てのBoneを含める）
//--------------------------------------------------------------------------------
class MotionFrame
{
public:
	MotionFrame(void) { BoneFrames.clear(); }
	~MotionFrame() { BoneFrames.clear(); }

	list<BoneFrame>	BoneFrames;
};

//--------------------------------------------------------------------------------
//  MotionInfoクラス
//--------------------------------------------------------------------------------
class MotionInfo
{
public:
	MotionInfo(void)
		: IsLoop(false)
	{
		MotionFrames.clear();
	}
	~MotionInfo() { MotionFrames.clear(); }

	bool				IsLoop;
	vector<MotionFrame>	MotionFrames;
};