////--------------------------------------------------------------------------------
////
////　motionInfo.h
////	Author : Xu Wenjie
////	Date   : 2017-07-06
////--------------------------------------------------------------------------------
//#pragma once
//
////--------------------------------------------------------------------------------
////  インクルードファイル
////--------------------------------------------------------------------------------
//#include "main.h"
//
////--------------------------------------------------------------------------------
////  クラス宣言
////--------------------------------------------------------------------------------
////--------------------------------------------------------------------------------
////  KeyInfoクラス
////--------------------------------------------------------------------------------
//class CKeyInfo
//{
//public:
//	CKeyInfo(const CKFVec3& vPos, const CKFVec3& vRot)
//		: c_vPos(vPos), c_vRot(vRot) {}
//	~CKeyInfo() {}
//
//	const CKFVec3 c_vPos;
//	const CKFVec3 c_vRot;
//};
//
////--------------------------------------------------------------------------------
////  CModelKeyInfoクラス
////	モデルのモーションに関わるボーン数分のキー情報を保存する
////--------------------------------------------------------------------------------
//class CModelKeyInfo
//{
//public:
//	CModelKeyInfo(const vector<CKeyInfo>& vecKey)
//		: c_vecKey(vecKey) {}
//	CModelKeyInfo() {}
//
//	const vector<CKeyInfo> c_vecKey;
//};
//
////--------------------------------------------------------------------------------
////  KeyFrameクラス
////--------------------------------------------------------------------------------
//class CKeyFrame
//{
//public:
//	CKeyFrame(const vector<CModelKeyInfo>& vecModelKey)
//		: c_vecModelKey(vecModelKey) {}
//	~CKeyFrame() {}
//
//	const vector<CModelKeyInfo> c_vecModelKey;
//};
//
////--------------------------------------------------------------------------------
////  MotionInfoクラス
////--------------------------------------------------------------------------------
//class CMotionInfo
//{
//public:
//	CMotionInfo(const bool& bLoop, const vector<CKeyFrame>& vecKeyFrame)
//		: c_bLoop(bLoop), c_vecKeyFrame(vecKeyFrame) {}
//	~CMotionInfo() {}
//
//	const bool c_bLoop;
//	const vector<CKeyFrame> c_vecKeyFrame;
//};