//--------------------------------------------------------------------------------
//	OBBColliderコンポネント
//　OBBColliderComponent.cpp
//	Author : Xu Wenjie
//	Date   : 2017-07-28
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "OBBColliderComponent.h"

//--------------------------------------------------------------------------------
//  クラス
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
list<CKFVec3> COBBColliderComponent::GetWorldVertexes(void)
{
	auto& listVtx = CBoxColliderComponent::GetLocalVertexes();
	const auto& mtxWorld = GetMatrixWorld();
	for (auto itr = listVtx.begin(); itr != listVtx.end(); ++itr)
	{
		*itr = CKFMath::Vec3TransformCoord(*itr, mtxWorld);
	}
	return listVtx;
}