//--------------------------------------------------------------------------------
//
//　rendererDX.h
//	Author : Xu Wenjie
//	Date   : 2016-05-31
//--------------------------------------------------------------------------------
//  Update : 
//	
//--------------------------------------------------------------------------------
#ifndef _RENDERER_DX_H_
#define _RENDERER_DX_H_

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  定数定義
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  プロトタイプ宣言
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
class CRendererDX
{
public:
	CRendererDX();
	~CRendererDX();

	KFRESULT			Init(HWND hWnd,BOOL bWindow);
	void				Uninit(void);
	void				Update(void);
	KFRESULT			BeginDraw(void);
	void				EndDraw(void);

	//Get関数
	LPDIRECT3DDEVICE9	GetDevice(void);

private:
	enum RENDER_MODE
	{
		RM_NORMAL,		//背面カリング、塗りつぶし
		RM_WIREFRAME	//ワイヤーフレーム（デバッグ用）
	};

	void				SetRenderMode(const RENDER_MODE &rm);

	LPDIRECT3D9			m_pD3D;			// Direct3Dオブジェクト
	LPDIRECT3DDEVICE9	m_pD3DDevice;	// Deviceオブジェクト(描画に必要)
	
#ifdef _DEBUG
	void		DrawFPS(void);
	LPD3DXFONT	m_pFont;		// フォントへのポインタ
#endif
};

#endif