//--------------------------------------------------------------------------------
//
//　renderSystem.cpp
//	Author : Xu Wenjie
//	Date   : 2017-11-01
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "main.h"
#include "renderSystem.h"
#if defined(USING_DIRECTX) && (DIRECTX_VERSION == 9)
#include "renderSystemDirectX9.h"
#endif

//--------------------------------------------------------------------------------
//  静的メンバー変数宣言
//--------------------------------------------------------------------------------
RenderSystem* RenderSystem::instance = nullptr;

//--------------------------------------------------------------------------------
//
//  public
//
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//	関数名：Create
//  関数説明：生成処理
//	引数：	hInstance：値
//			hWnd：
//			isWindowMode：
//	戻り値：Manager*
//--------------------------------------------------------------------------------
RenderSystem* RenderSystem::Create(HWND hWnd, BOOL isWindowMode)
{
	if (instance) return instance;
#if defined(USING_DIRECTX) && (DIRECTX_VERSION == 9)
	instance = new RenderSystemDirectX9;
#endif
	instance->init(hWnd, isWindowMode);
	return instance;
}

//--------------------------------------------------------------------------------
//	関数名：Release
//  関数説明：破棄処理
//	引数：	なし
//	戻り値：なし
//--------------------------------------------------------------------------------
void RenderSystem::Release(void)
{
	SAFE_UNINIT(instance);
}