//--------------------------------------------------------------------------------
//	レンダーステートクラス
//　renderState.cpp
//	Author : Xu Wenjie
//	Date   : 2017-05-22
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "main.h"
#include "renderState.h"
#include "manager.h"

#ifdef USING_DIRECTX9
#include "rendererDX.h"
#endif

//--------------------------------------------------------------------------------
//  クラス
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  LightOffクラス
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  レンダーステート設定
//--------------------------------------------------------------------------------
void CLightOffRenderState::SetRenderState(void)
{
#ifdef USING_DIRECTX9
	LPDIRECT3DDEVICE9 pDevice = GetManager()->GetRenderer()->GetDevice();
	pDevice->SetRenderState(D3DRS_LIGHTING, FALSE);
#endif
}

//--------------------------------------------------------------------------------
//  レンダーステートリセット
//--------------------------------------------------------------------------------
void CLightOffRenderState::ResetRenderState(void)
{
#ifdef USING_DIRECTX9
	LPDIRECT3DDEVICE9 pDevice = GetManager()->GetRenderer()->GetDevice();
	pDevice->SetRenderState(D3DRS_LIGHTING, TRUE);
#endif
}