//--------------------------------------------------------------------------------
//	リジッドボディコンポネント
//　rigidbodyComponent.h
//	Author : Xu Wenjie
//	Date   : 2017-05-18
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "component.h"

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  リジッドボディコンポネントクラス
//--------------------------------------------------------------------------------
class Rigidbody : public Component
{
public:
	//--------------------------------------------------------------------------------
	//  構造体定義
	//--------------------------------------------------------------------------------
	enum Type
	{
		NullRigidbody = 0,
		Rigidbody3D
	};

	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	Rigidbody(GameObject* const owner, const Type& type) : Component(owner), currentType(type) {}
	~Rigidbody() {}

	virtual bool	Init(void) override = 0;
	virtual void	Uninit(void) override = 0;
	virtual void	Update(void) = 0;
	virtual void	LateUpdate(void) = 0;

	//Get関数
	const auto		GetType(void) const { return currentType; }

protected:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	Rigidbody() : Component(), currentType(Type::NullRigidbody) {}

	//--------------------------------------------------------------------------------
	//  変数定義
	//--------------------------------------------------------------------------------
	Type currentType;
};

//--------------------------------------------------------------------------------
//  ヌルリジッドボディコンポネント
//--------------------------------------------------------------------------------
class NullRigidbody : public Rigidbody
{
public:
	NullRigidbody() : Rigidbody() {}
	~NullRigidbody() {}

	bool	Init(void) override { return true; }
	void	Uninit(void) override {}
	void	Update(void) override {}
	void	LateUpdate(void) override {}
	void	Release(void) override {}
}; 
