//--------------------------------------------------------------------------------
//	sphereColliderコンポネント
//　sphereColliderComponent.h
//	Author : Xu Wenjie
//	Date   : 2017-06-04
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "colliderComponent.h"

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  sphereColliderポネントクラス
//--------------------------------------------------------------------------------
class CSphereColliderComponent : public CColliderComponent
{
public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	CSphereColliderComponent(CGameObject* const pGameObj, const CM::MODE& mode, const CKFVec3& vPos, const float& fRadius)
		: CColliderComponent(pGameObj, CM::COL_SPHERE, mode, vPos)
		, m_fRadius(fRadius) {}

	~CSphereColliderComponent() {}

	bool	Init(void) override { return true; }
	void	Update(void) override {}

	//Get関数
	float	GetRadius(void) { return m_fRadius; }

private:
	//--------------------------------------------------------------------------------
	//  定数定義
	//--------------------------------------------------------------------------------
	float		m_fRadius;	//半径
};