//--------------------------------------------------------------------------------
//	sphereColliderコンポネント
//　sphereCollider.h
//	Author : Xu Wenjie
//--------------------------------------------------------------------------------
#pragma once
#include "collider.h"

//--------------------------------------------------------------------------------
//  sphereColliderポネントクラス
//--------------------------------------------------------------------------------
class SphereCollider : public Collider
{
public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	SphereCollider(GameObject& owner, const ColliderMode& mode, const float& radius)
		: Collider(owner, kSphere, mode)
		, radius_(radius) {}
	~SphereCollider() {}

	//Get関数
	const float& GetRadius(void) const { return radius_; }

private:
	//--------------------------------------------------------------------------------
	//  変数定義
	//--------------------------------------------------------------------------------
	float radius_;
};