//--------------------------------------------------------------------------------
//　ui_object.h
//	uiオブジェクト
//	Author : 徐文杰(KodFreedom)
//--------------------------------------------------------------------------------
#include "ui_object.h"
#include "main_system.h"
#include "ui_system.h"

//--------------------------------------------------------------------------------
//  コンストラクタ
//--------------------------------------------------------------------------------
UIObject::UIObject(const int order)
	: order_(order)
{
	MainSystem::Instance()->GetUISystem()->Register(this);
}

//--------------------------------------------------------------------------------
//  リリース
//--------------------------------------------------------------------------------
void UIObject::Release(void)
{
	MainSystem::Instance()->GetUISystem()->Deregister(this);
	Uninit();
	delete this;
}