//--------------------------------------------------------------------------------
//	歩くステート
//　walkState.h
//	Author : Xu Wenjie
//	Date   : 2017-11-07
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "main.h"
#include "walkState.h"
#include "neutralState.h"
#include "jumpState.h"
#include "actorController.h"
#include "animator.h"

//--------------------------------------------------------------------------------
//
//	public
//
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  コンストラクタ
//--------------------------------------------------------------------------------
WalkState::WalkState()
	: ActorState("Walk") {}

//--------------------------------------------------------------------------------
//	関数名：Init
//  関数説明：初期化関数
//	引数：	actor：アクターコントローラ
//	戻り値：なし
//--------------------------------------------------------------------------------
void WalkState::Init(ActorController& actor)
{
}

//--------------------------------------------------------------------------------
//	関数名：Act
//  関数説明：行動関数
//	引数：	actor：アクターコントローラ
//	戻り値：なし
//--------------------------------------------------------------------------------
void WalkState::Act(ActorController& actor)
{
	if (actor.GetMovement().SquareMagnitude() <= 0.0f)
	{
		actor.Change(new NeutralState);
		return;
	}

	checkGrounded(actor);
	move(actor);
	actor.GetAnimator()->SetMovement(actor.GetMovement().Magnitude());

	if (actor.GetIsJump())
	{
		jump(actor);
		actor.Change(new JumpState);
		return;
	}
}