//--------------------------------------------------------------------------------
//	風車ビヘイビアコンポネント
//　windmillBehaviorComponent.h
//	Author : Xu Wenjie
//	Date   : 2017-09-12
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "behaviorComponent.h"

//--------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
class CWindmillBehaviorComponent : public CBehaviorComponent
{
public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	CWindmillBehaviorComponent(GameObject* const pGameObj)
		: CBehaviorComponent(pGameObj)
		, RotSpeed(0.01f)
		, m_pFan(nullptr)
	{}
	~CWindmillBehaviorComponent() {}

	bool	Init(void) override;
	void	Uninit(void) override {}
	void	Update(void) override;
	void	LateUpdate(void) override {}

	void	OnTrigger(Collider& colliderThis, Collider& collider) override {}
	void	OnCollision(CollisionInfo& collisionInfo) override {}

private:
	//--------------------------------------------------------------------------------
	//  変数定義
	//--------------------------------------------------------------------------------
	GameObject*	findFan(GameObject* pParent);

	//--------------------------------------------------------------------------------
	//  定数定義
	//--------------------------------------------------------------------------------
	float			RotSpeed;
	GameObject*	m_pFan;
};